randread/32_node/job_1470975_fiojob_64/nid00061_fiojob_64/output.log
test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=256
...
fio-3.27
Starting 64 processes
rand-read: Laying out IO file (1 file / 1024MiB)
rand-read: Laying out IO file (1 file / 1024MiB)
rand-read: Laying out IO file (1 file / 1024MiB)
[...]

test: (groupid=0, jobs=64): err= 0: pid=146733: Mon Jul 19 19:30:54 2021
  read: IOPS=3005, BW=11.7MiB/s (12.3MB/s)(3522MiB/300059msec)
    slat (usec): min=574, max=518080, avg=21267.83, stdev=16490.24
    clat (usec): min=12, max=11736k, avg=5381201.06, stdev=1129911.05
     lat (msec): min=2, max=11785, avg=5402.47, stdev=1133.61
    clat percentiles (msec):
     |  1.00th=[ 2366],  5.00th=[ 4144], 10.00th=[ 4329], 20.00th=[ 4530],
     | 30.00th=[ 4732], 40.00th=[ 4933], 50.00th=[ 5134], 60.00th=[ 5470],
     | 70.00th=[ 5738], 80.00th=[ 6141], 90.00th=[ 7148], 95.00th=[ 7483],
     | 99.00th=[ 8356], 99.50th=[ 8792], 99.90th=[ 9463], 99.95th=[ 9731],
     | 99.99th=[11342]
   bw (  KiB/s): min= 3912, max=18544, per=99.84%, avg=12001.78, stdev=31.45, samples=37674
   iops        : min=  978, max= 4636, avg=3000.45, stdev= 7.86, samples=37674
  lat (usec)   : 20=0.01%, 50=0.01%
  lat (msec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.02%, 100=0.03%
  lat (msec)   : 250=0.08%, 500=0.13%, 750=0.11%, 1000=0.11%, 2000=0.39%
  lat (msec)   : >=2000=99.12%
  cpu          : usr=0.14%, sys=0.86%, ctx=902303, majf=0, minf=18887
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=901679,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=256

Run status group 0 (all jobs):
   READ: bw=11.7MiB/s (12.3MB/s), 11.7MiB/s-11.7MiB/s (12.3MB/s-12.3MB/s), io=3522MiB (3693MB), run=300059-300059msec